package com.ayalma.mobile_pos_plugin.posSdk.Parsian

import android.content.Intent

class Response(intent: Intent) {

     var responseCode=intent.getStringExtra(Response.RESPONSE_CODE)
     var cardNumber = intent.getStringExtra(Response.CARD_NUMBER)
     var terminalNumber = intent.getStringExtra(Response.TERMINAL_NUMBER)
     var serialNumber =  intent.getStringExtra(Response.SERIAL_NUMBER)
     var referenceNumber = intent.getStringExtra(Response.REFERENCE_NUMBER)
     var transactionType = intent.getStringExtra(Response.TRANSACTION_TYPE)
     var dateTime = intent.getStringExtra(Response.DATE_TIME)
     var amount = intent.getStringExtra(Response.AMOUNT)
     var balance = intent.getStringExtra(Response.BALANCE)
     var pin = intent.getStringExtra(Response.PIN)
     var serial = intent.getStringExtra(Response.SERIAL)
     var phone = intent.getStringExtra(Response.PHONE)

     companion object{
          const val TRANSACTION_TYPE = "TransactionType"
          const val RESPONSE_CODE ="ResponseCode"
          const val CARD_NUMBER ="CardNumber"
          const val REFERENCE_NUMBER ="RRN"
          const val SERIAL_NUMBER ="SerialNumber"
          const val TERMINAL_NUMBER ="TerminalNumber"
          const val DATE_TIME ="DateTime"
          const val AMOUNT ="Amount"
          const val BALANCE ="Balance"
          const val PIN ="Pin"
          const val SERIAL ="Serial"
          const val PHONE ="Phone"

          const val PRINT_STATUS ="PrintStatus"
     }


     fun getMessage():String{

               return when(responseCode){
                    "00"-> "تراکنش با موفقيت انجام پذیرفت."
                    "01" -> "صادر کننده کارت از انجام تراکنش صرف نظر کرد."
                    "02"->"عمليات اصالحيه یا تایيدیه این تراکنش قبالٌ با موفقيت صورت پذیرفته است."
                    "03"->"پذیرندهی فروشگاهی نامعتبر می باشد."
                    "04"->"کارت توسط دستگاه ضبط شود."
                    "05"->" از انجام تراکنش صزف نظر شد/ به تراکنش رسيدگی نشد"
                    "06"->"بروز خطا"
                    "07"->"به دليل شرایط خاص کارت توسط دستگاه ضبط شود."
                    "08"->"با تشخيص هویت دارندهی کارت، تراکنش موفق می باشد"
                    "12"->"تراکنش نامعتبر است."
                    "13"->"مبلغ تراکنش اصالحيه نادرست است."
                    "14"->"شماره کارت ارسالی نامعتبر است )وجود ندارد("
                    "15"->"صادر کنندهی کارت نامعتبر است )وجود ندارد("
                    "16"->"تراکنش مورد تایيد است و اطالعات شيار سوم کارت بروزرسانی شود."
                    "19"->"تراکنش مجدداٌ ارسال شود."
                    "23"->"کارمزد ارسالی پذیرنده غير قابل قبول است."
                    "25"->"تراکنش اصلی یافت نشد."
                    "30"->"قالب پيام دارای اشكال است."
                    "31"->"پذیرنده توسط سویيچ پشتيبانی نمی شود."
                    "33"->"تاریخ انقضای کارت سپری شده است، کارت توسط دستگاه ضبط شود."
                    "34"->"تراکنش اصلی با موفقيت انجام نپذیرفته است )کارت مظنون به تقلب/کارت توسط دستگاه ضبط شود("
                    "36"->"کارت محدود شده است، کارت توسط دستگاه ضبط شود."
                    "38"->"تعداد دفعات ورود رمز غلط بيش از حد مجاز است، کارت توسط دستگاه ضبط شود."
                    "39"->"کارت حساب اعتباری ندارد."
                    "40"->"عمليات درخواستی پشتيبانی نمی گردد."
                    "41"->" کارت مفقودی می باشد، کارت توسط دستگاه ضبط می شود."
                    "42"->"کارت حساب عمومی ندارد."
                    "43"->"کارت مسروقه می باشد، کارت توسط دستگاه ضبط شود."
                    "44"->"کارت حساب سرمایه گذاری ندارد."
                    "51"->"موجودی حساب کافی نمیباشد."
                    "52"->"کارت حساب جاری ندارد"
                    "53"->"کارت حساب قرض الحسنه ندارد."
                    "54"->"تاریخ انقضای کارت سپری شده است."
                    "55"->"رمزکارت نامعتبر است."
                    "56"->"کارت نامعتبر است"
                    "57"->"انجام تراکنش مربوطه توسط دارندهی کارت مجاز نمی باشد."
                    "58"->" انجام تراکنش مربوطه توسط پایانه انجام دهنده مجاز نمی باشد."
                    "59"->"کارت مظنون به تقلب است."
                    "61"->"مبلغ تراکنش بيش از حد مجاز می باشد"
                    "62"->"کارت محدود شده است."
                    "63"->"تمهيدات امنيتی نقض گردیده است."
                    "64"->"مبلغ تراکنش اصلی نامعتبر است )تراکنش مالی اصلی با این مبلغ نمی باشد("
                    "65"->"تعداد درخواست تراکنش بيش از حد مجاز باالتر است."
                    "67"->"کارت توسط دستگاه ضبط شود."
                    "75"->"تعداددفعات ورود رمز غلط بيش از حد مجاز است."
                    "77"->"روز مالی تراکنش نامعتبر است یا مهلت زمان ارسال اصالحيه به پایان رسيده است"
                    "78"->"کارت فعال نيست."
                    "79"->" حساب متصل به کارت نامعتبر است یا دارای اشكال است."
                    "80"->"تراکنش موفق عمل نكرده است."
                    "83"->" ارائه دهنده خدمات پرداخت یا سامانه شاپرک اعالم off Sign نموده است"
                    "84"->"وضعيت سامانه یا بانک مقصد تراکنش غير فعال می باشد. )down Host )"
                    "86"->"موسسه ارسال کننده، شاپرک یا مقصد تراکنش در حالت off sign است."
                    "90"->"سامانه مقصد تراکنش در حال انجام عمليات پایان روز می باشد."
                    "91"->"صادر کننده یا سویيچ مقصد فعال نمی باشد. )مدت زمان انتظار برای دریافت پاسخ پایان یافته است("
                    "92"->"مسيری برای ارسال تراکنش به مقصد یافت نشد. )موسسه های اعالمی معتبر نيستند("
                    "93"->"تراکنش با موفقيت انجام نشد. )کمبود منابع و نقض موارد قانونی("
                    "94"->"ارسال تراکنش تكراری"
                    "96"->" بروز خطای سيستمی در انجام تراکنش"
                    "97"->"فرآیند تغيير کليد برای صادرکننده یا پذیرنده در حال انجام است."






                    else->""
               }

          return "";
     }
}